OpenFOAM-6-cantera/tutorials/multiphase/compressibleMultiphaseInterFoam/laminar/damBreak4phase/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    leftWall
    {
        type            fixedValue;
        value           $internalField;
    }
    rightWall
    {
        type            fixedValue;
        value           $internalField;
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform 293;
    }
    atmosphere
    {
        type            inletOutlet;
        phi             rhoPhi;
        inletValue      $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
